---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures
source: html/8f9298be-9e12-d84b-8459-c862355e698d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures

Failures about SiteImport.

## Syntax (C#)
```csharp
public static class SiteImportFailures
```